InformationRegisters/А_ПравилаНачисленияУслугОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>А_ПравилаНачисленияУслугОтгрузки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Режим</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.А_РежимыНачисленияУслугОтгрузки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/А_ПодборАктовПоОтгрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>А_ПодборАктовПоОтгрузке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Приобретение</Name>
					<Type>
						<v8:Type>d5p1:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Реализация</Name>
					<Type>
						<v8:Type>d5p1:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>d5p1:DocumentRef.АктВыполненныхРабот</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.А_СтатусыПодбораАктовОтгрузки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДельтаДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодтвержденоСтатьейPL</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодтвержденоКонтрагентом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КандидатовВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПодбора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Отгрузка</Name>
					<Type>
						<v8:Type>d5p1:DocumentRef.А_ОтгрузкаПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ПрочиеРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ПрочиеРасходы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРеглБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостояннаяРазница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременнаяРазница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпрБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПрочихАктивов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РаспределениеПрочихЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоляСтоимости</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорАналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСтатьяКалькуляции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиКалькуляции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетСебестоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетПартий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорНаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИсточникДвижений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьИсточникиДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорОбъектУчетаРезервов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыУчетаРезервовПредстоящихРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорВидРезервов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Резервы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИсточника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИсточниковДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаPL</Name>
					<Type>
						<v8:Type>cfg:EnumRef.А_ФормыPL</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/А_СтатусыПодбораАктовОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>А_СтатусыПодбораАктовОтгрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачисляетсяВЕРП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Найдено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НайденоБезПодтверждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неоднозначно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНайдено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПравилоНеЗадано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/А_РежимыНачисленияУслугОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>А_РежимыНачисленияУслугОтгрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачислятьВЕРП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументыИзБухгалтерии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/А_ОтгрузкаПродукцииСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Подбирает акты (приобретение и реализацию) для одной отгрузки продукции.
//
// Параметры:
//   ОтгрузкаСсылка - ДокументСсылка.А_ОтгрузкаПродукции - документ для подбора.
//
// Возвращаемое значение:
//   Структура - Статус, Приобретение, Реализация, Комментарий.
//
Функция ПодобратьАктыПоОтгрузке(ОтгрузкаСсылка) Экспорт

	Отгрузки = Новый Массив;
	Отгрузки.Добавить(ОтгрузкаСсылка);

	Результат = ВыполнитьПодбор(Отгрузки);

	Итог = Результат.Найти(ОтгрузкаСсылка, "Отгрузка");
	Если Итог = Неопределено Тогда
		Возврат Новый Структура("Статус, Приобретение, Реализация, Комментарий",
			Перечисления.А_СтатусыПодбораАктовОтгрузки.ПравилоНеЗадано,
			Документы.ПриобретениеТоваровУслуг.ПустаяСсылка(),
			Неопределено,
			"Документ не попал в выборку подбора");
	КонецЕсли;

	Возврат Новый Структура("Статус, Приобретение, Реализация, Комментарий",
		Итог.Статус, Итог.Приобретение, Итог.Реализация, Итог.Комментарий);

КонецФункции

// Подбирает акты для всех отгрузок периода.
//
// Параметры:
//   НачалоПериода - Дата - начало периода отбора отгрузок.
//   КонецПериода  - Дата - конец периода отбора отгрузок.
//
// Возвращаемое значение:
//   ТаблицаЗначений - результат подбора, см. НоваяТаблицаРезультата.
//
Функция ПодобратьАктыЗаПериод(НачалоПериода, КонецПериода) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОП.Ссылка КАК Отгрузка
	|ИЗ
	|	Документ.А_ОтгрузкаПродукции КАК ОП
	|ГДЕ
	|	ОП.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ОП.ПометкаУдаления
	|УПОРЯДОЧИТЬ ПО
	|	ОП.Дата";

	Отгрузки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Отгрузка");

	Возврат ВыполнитьПодбор(Отгрузки);

КонецФункции

// Определяет режим начисления услуг по паре заказчик - цех.
//
// Параметры:
//   Заказчик - СправочникСсылка.СтруктураПредприятия - объект-получатель.
//   Цех      - СправочникСсылка.СтруктураПредприятия - подразделение-отправитель.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.А_РежимыНачисленияУслугОтгрузки - пустая ссылка, если правила нет.
//
Функция ОпределитьРежимНачисления(Заказчик, Цех) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказчик", Заказчик);
	Запрос.УстановитьПараметр("Цех", Цех);
	Запрос.УстановитьПараметр("ПустойЦех", Справочники.СтруктураПредприятия.ПустаяСсылка());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Правила.Режим КАК Режим,
	|	ВЫБОР
	|		КОГДА Правила.Цех = &Цех
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	РегистрСведений.А_ПравилаНачисленияУслугОтгрузки КАК Правила
	|ГДЕ
	|	Правила.Заказчик = &Заказчик
	|	И (Правила.Цех = &Цех
	|		ИЛИ Правила.Цех = &ПустойЦех)
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Режим;
	КонецЕсли;

	Возврат Перечисления.А_РежимыНачисленияУслугОтгрузки.ПустаяСсылка();

КонецФункции

// Заполняет регистр правил по фактическому состоянию флага А_НачислятьУслуги за период.
//
// Параметры:
//   НачалоПериода - Дата - начало периода анализа.
//   КонецПериода  - Дата - конец периода анализа.
//
// Возвращаемое значение:
//   Структура - Записано, НачислятьВЕРП, ИзБухгалтерии, Конфликтов.
//
Функция ЗасеятьПравилаПоПериоду(НачалоПериода, КонецПериода) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("ПустоеПодразделение", Справочники.СтруктураПредприятия.ПустаяСсылка());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОП.Заказчик КАК Заказчик,
	|	ОП.Подразделение КАК Цех,
	|	СУММА(ВЫБОР КОГДА ОП.А_НачислятьУслуги ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК СФлагом,
	|	СУММА(ВЫБОР КОГДА ОП.А_НачислятьУслуги ТОГДА 0 ИНАЧЕ 1 КОНЕЦ) КАК БезФлага
	|ИЗ
	|	Документ.А_ОтгрузкаПродукции КАК ОП
	|ГДЕ
	|	ОП.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ОП.ПометкаУдаления
	|	И ОП.Заказчик <> &ПустоеПодразделение
	|СГРУППИРОВАТЬ ПО
	|	ОП.Заказчик,
	|	ОП.Подразделение
	|УПОРЯДОЧИТЬ ПО
	|	Заказчик,
	|	Цех";

	Статистика = Новый Структура("Записано, НачислятьВЕРП, ИзБухгалтерии, Конфликтов", 0, 0, 0, 0);
	ТекстПериода = Формат(НачалоДня(НачалоПериода), "ДФ=dd.MM.yyyy") + " - "
		+ Формат(КонецДня(КонецПериода), "ДФ=dd.MM.yyyy");

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		Конфликт = (Выборка.СФлагом > 0 И Выборка.БезФлага > 0);

		Если Конфликт ИЛИ Выборка.СФлагом = 0 Тогда
			Режим = Перечисления.А_РежимыНачисленияУслугОтгрузки.ДокументыИзБухгалтерии;
		Иначе
			Режим = Перечисления.А_РежимыНачисленияУслугОтгрузки.НачислятьВЕРП;
		КонецЕсли;

		Комментарий = "Засев по " + ТекстПериода;
		Если Конфликт Тогда
			Комментарий = Комментарий + ". КОНФЛИКТ: с флагом " + Выборка.СФлагом
				+ ", без флага " + Выборка.БезФлага + " - проверьте вручную";
			Статистика.Конфликтов = Статистика.Конфликтов + 1;
		КонецЕсли;

		НаборЗаписей = РегистрыСведений.А_ПравилаНачисленияУслугОтгрузки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Заказчик.Установить(Выборка.Заказчик);
		НаборЗаписей.Отбор.Цех.Установить(Выборка.Цех);

		Запись = НаборЗаписей.Добавить();
		Запись.Заказчик = Выборка.Заказчик;
		Запись.Цех = Выборка.Цех;
		Запись.Режим = Режим;
		Запись.Комментарий = Лев(Комментарий, 150);
		НаборЗаписей.Записать(Истина);

		Статистика.Записано = Статистика.Записано + 1;
		Если Режим = Перечисления.А_РежимыНачисленияУслугОтгрузки.НачислятьВЕРП Тогда
			Статистика.НачислятьВЕРП = Статистика.НачислятьВЕРП + 1;
		Иначе
			Статистика.ИзБухгалтерии = Статистика.ИзБухгалтерии + 1;
		КонецЕсли;

	КонецЦикла;

	Возврат Статистика;

КонецФункции

// Восстанавливает реквизиты документа из журнала подбора.
// Применяется, если обмен из Казны затер ранее записанные ссылки.
//
// Параметры:
//   ОтгрузкаСсылка - ДокументСсылка.А_ОтгрузкаПродукции - документ для восстановления.
//
// Возвращаемое значение:
//   Булево - Истина, если реквизиты были изменены.
//
Функция ЗаполнитьРеквизитыИзЖурнала(ОтгрузкаСсылка) Экспорт

	Отбор = Новый Структура("Отгрузка", ОтгрузкаСсылка);
	Записи = РегистрыСведений.А_ПодборАктовПоОтгрузке.Получить(Отбор);

	Если Записи = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат ЗаписатьРеквизитыОтгрузки(ОтгрузкаСсылка, Записи.Приобретение, Записи.Реализация);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Основной алгоритм подбора: лестница окон, приоритеты, монопольное закрепление.
Функция ВыполнитьПодбор(Отгрузки)

	Результат = НоваяТаблицаРезультата();
	Если Отгрузки.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	ДанныеОтгрузок = ПолучитьДанныеОтгрузок(Отгрузки);

	КОбработке = Новый Массив;
	КВЕРП = Новый Массив;
	Для Каждого СтрокаОтгрузки Из ДанныеОтгрузок Цикл

		Режим = ОпределитьРежимНачисления(СтрокаОтгрузки.Заказчик, СтрокаОтгрузки.Цех);

		Если Не ЗначениеЗаполнено(Режим) Тогда
			ДобавитьРезультат(Результат, СтрокаОтгрузки.Отгрузка,
				Перечисления.А_СтатусыПодбораАктовОтгрузки.ПравилоНеЗадано, Неопределено, 0,
				"Нет правила для пары """ + СтрокаОтгрузки.Заказчик + """ - """ + СтрокаОтгрузки.Цех + """");
			Продолжить;
		КонецЕсли;

		Если Режим = Перечисления.А_РежимыНачисленияУслугОтгрузки.НачислятьВЕРП Тогда
			КВЕРП.Добавить(СтрокаОтгрузки.Отгрузка);
			Продолжить;
		КонецЕсли;

		Если СтрокаОтгрузки.СуммаДокумента = 0 Тогда
			ДобавитьРезультат(Результат, СтрокаОтгрузки.Отгрузка,
				Перечисления.А_СтатусыПодбораАктовОтгрузки.НеНайдено, Неопределено, 0,
				"Сумма документа равна нулю");
			Продолжить;
		КонецЕсли;

		КОбработке.Добавить(СтрокаОтгрузки.Отгрузка);

	КонецЦикла;

	ДобавитьРезультатыВЕРП(Результат, КВЕРП);

	Если КОбработке.Количество() = 0 Тогда
		ЗафиксироватьРезультат(Результат);
		Возврат Результат;
	КонецЕсли;

	КандидатыПриобретения = ПолучитьКандидатовПриобретения(КОбработке);
	КандидатыРеализации = ПолучитьКандидатовРеализации(КОбработке);

	ЗанятыеПриобретения = ПолучитьЗанятыеДокументы(КОбработке, "Приобретение");
	ЗанятыеРеализации = ПолучитьЗанятыеДокументы(КОбработке, "Реализация");

	НазначенияПриобретения = РаспределитьКандидатов(КандидатыПриобретения, КОбработке, ЗанятыеПриобретения);
	НазначенияРеализации = РаспределитьКандидатов(КандидатыРеализации, КОбработке, ЗанятыеРеализации);

	Для Каждого ОтгрузкаСсылка Из КОбработке Цикл

		Назначение = НазначенияПриобретения.Получить(ОтгрузкаСсылка);
		НазначениеПродажи = НазначенияРеализации.Получить(ОтгрузкаСсылка);
		Реализация = ?(НазначениеПродажи = Неопределено, Неопределено, НазначениеПродажи.Документ);

		Если Назначение = Неопределено Тогда
			ДобавитьРезультат(Результат, ОтгрузкаСсылка,
				Перечисления.А_СтатусыПодбораАктовОтгрузки.НеНайдено, Неопределено, 0,
				"Приобретение не найдено в окне +/- 3 дня", Реализация);
			Продолжить;
		КонецЕсли;

		Если Назначение.Неоднозначно Тогда
			ДобавитьРезультат(Результат, ОтгрузкаСсылка,
				Перечисления.А_СтатусыПодбораАктовОтгрузки.Неоднозначно, Неопределено,
				Назначение.КандидатовВсего,
				"Приоритеты не развели кандидатов - разберите вручную", Реализация);
			Продолжить;
		КонецЕсли;

		Подтверждено = Назначение.СтатьяОК ИЛИ Назначение.КонтрагентОК;
		Статус = ?(Подтверждено,
			Перечисления.А_СтатусыПодбораАктовОтгрузки.Найдено,
			Перечисления.А_СтатусыПодбораАктовОтгрузки.НайденоБезПодтверждения);

		ДобавитьРезультат(Результат, ОтгрузкаСсылка, Статус, Назначение, Назначение.КандидатовВсего,
			"", Реализация);

	КонецЦикла;

	ЗафиксироватьРезультат(Результат);

	Возврат Результат;

КонецФункции

// Ветка "начисляется в ЕРП": связь ТОЧНАЯ, через ДокОказаниеУслугМеждуПодразделениями.
// Цепочка Оказание -> РеализацияТоваровУслуг -> ПриобретениеТоваровУслуг построена
// самим механизмом услуг, подбор по сумме и дате тут не нужен.
Процедура ДобавитьРезультатыВЕРП(Результат, Отгрузки)

	Если Отгрузки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Отгрузки", Отгрузки);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОП.Ссылка КАК Отгрузка,
	|	РТУ.Ссылка КАК Реализация,
	|	ПТУ.Ссылка КАК Приобретение
	|ИЗ
	|	Документ.А_ОтгрузкаПродукции КАК ОП
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РТУ
	|		ПО РТУ.А_ОказаниеУслугМеждуПодразделениями = ОП.ДокОказаниеУслугМеждуПодразделениями
	|			И НЕ РТУ.ПометкаУдаления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПТУ
	|		ПО ПТУ.А_РеализацияТоваровУслуг = РТУ.Ссылка
	|			И НЕ ПТУ.ПометкаУдаления
	|ГДЕ
	|	ОП.Ссылка В (&Отгрузки)";

	Найденные = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Найденные.Получить(Выборка.Отгрузка) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Найденные.Вставить(Выборка.Отгрузка,
			Новый Структура("Реализация, Приобретение", Выборка.Реализация, Выборка.Приобретение));
	КонецЦикла;

	Для Каждого ОтгрузкаСсылка Из Отгрузки Цикл

		Данные = Найденные.Получить(ОтгрузкаСсылка);
		Реализация = ?(Данные = Неопределено, Неопределено, Данные.Реализация);
		Приобретение = ?(Данные = Неопределено,
			Документы.ПриобретениеТоваровУслуг.ПустаяСсылка(), Данные.Приобретение);

		Если ЗначениеЗаполнено(Приобретение) ИЛИ ЗначениеЗаполнено(Реализация) Тогда
			Комментарий = "Начисляется в ЕРП, документы взяты по цепочке оказания услуг";
		Иначе
			Комментарий = "Начисляется в ЕРП, но цепочка оказания услуг документов не дала";
		КонецЕсли;

		СтрокаРезультата = Результат.Добавить();
		СтрокаРезультата.Отгрузка = ОтгрузкаСсылка;
		СтрокаРезультата.Статус = Перечисления.А_СтатусыПодбораАктовОтгрузки.НачисляетсяВЕРП;
		СтрокаРезультата.Приобретение = Приобретение;
		СтрокаРезультата.Реализация = Реализация;
		СтрокаРезультата.Комментарий = Комментарий;

	КонецЦикла;

КонецПроцедуры

// Лестница окон +/-0, +/-1, +/-3 с монопольным закреплением документов.
Функция РаспределитьКандидатов(Кандидаты, Отгрузки, Занятые)

	Назначения = Новый Соответствие;
	Если Кандидаты.Количество() = 0 Тогда
		Возврат Назначения;
	КонецЕсли;

	// Порядок обхода отгрузок - по дате, чтобы результат был воспроизводим.
	Кандидаты.Сортировать("ОтгрузкаДата Возр, СтатьяОК Убыв, КонтрагентОК Убыв, Дельта Возр, Номер Возр");

	Ступени = Новый Массив;
	Ступени.Добавить(0);
	Ступени.Добавить(1);
	Ступени.Добавить(3);

	Для Каждого Ступень Из Ступени Цикл
		Для Каждого ОтгрузкаСсылка Из Отгрузки Цикл

			Если Назначения.Получить(ОтгрузкаСсылка) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;

			Доступные = Новый Массив;
			Для Каждого СтрокаКандидата Из Кандидаты.НайтиСтроки(
				Новый Структура("Отгрузка", ОтгрузкаСсылка)) Цикл

				Если СтрокаКандидата.Дельта > Ступень Тогда
					Продолжить;
				КонецЕсли;
				Если Занятые.Получить(СтрокаКандидата.Документ) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				Доступные.Добавить(СтрокаКандидата);

			КонецЦикла;

			Если Доступные.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;

			Лучший = Доступные[0];

			// Ничья приоритетов - не назначаем, отдаем человеку.
			Неоднозначно = Ложь;
			Если Доступные.Количество() > 1 Тогда
				Второй = Доступные[1];
				Неоднозначно = (Лучший.СтатьяОК = Второй.СтатьяОК)
					И (Лучший.КонтрагентОК = Второй.КонтрагентОК)
					И (Лучший.Дельта = Второй.Дельта);
			КонецЕсли;

			Назначение = Новый Структура("Документ, Дельта, СтатьяОК, КонтрагентОК, КандидатовВсего, Неоднозначно",
				Лучший.Документ, Лучший.Дельта, Лучший.СтатьяОК, Лучший.КонтрагентОК,
				Доступные.Количество(), Неоднозначно);
			Назначения.Вставить(ОтгрузкаСсылка, Назначение);

			Если Не Неоднозначно Тогда
				Занятые.Вставить(Лучший.Документ, ОтгрузкаСсылка);
			КонецЕсли;

		КонецЦикла;
	КонецЦикла;

	Возврат Назначения;

КонецФункции

// Шапки отгрузок, по которым запускается подбор.
Функция ПолучитьДанныеОтгрузок(Отгрузки)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Отгрузки", Отгрузки);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОП.Ссылка КАК Отгрузка,
	|	ОП.Дата КАК Дата,
	|	ОП.Заказчик КАК Заказчик,
	|	ОП.Подразделение КАК Цех,
	|	ОП.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.А_ОтгрузкаПродукции КАК ОП
	|ГДЕ
	|	ОП.Ссылка В (&Отгрузки)
	|УПОРЯДОЧИТЬ ПО
	|	ОП.Дата";

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Кандидаты приобретения: крюк ПТУ.Подразделение = Отгрузка.Заказчик.
// СтатьяОК - подтверждение через ПрочиеРасходы по статье расходов из статьи ДДС отгрузки.
Функция ПолучитьКандидатовПриобретения(Отгрузки)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Отгрузки", Отгрузки);
	Запрос.УстановитьПараметр("ПустоеОказание",
		Документы.А_ОказаниеУслугМеждуПодразделениями.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойКонтрагент", Справочники.Контрагенты.ПустаяСсылка());
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПР.Регистратор КАК Документ,
	|	ОП.Ссылка КАК Отгрузка
	|ПОМЕСТИТЬ втПодтвержденоСтатьей
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ПР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.А_ОтгрузкаПродукции КАК ОП
	|		ПО ПР.Подразделение = ОП.Заказчик
	|			И ПР.СтатьяРасходов = ОП.СтатьяДенежныхСредств.А_СтатьяРасходов
	|ГДЕ
	|	ОП.Ссылка В (&Отгрузки)
	|	И ТИПЗНАЧЕНИЯ(ПР.Регистратор) = ТИП(Документ.ПриобретениеТоваровУслуг)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОП.Ссылка КАК Отгрузка,
	|	ОП.Дата КАК ОтгрузкаДата,
	|	ПТУ.Ссылка КАК Документ,
	|	ПТУ.Номер КАК Номер,
	|	ВЫБОР
	|		КОГДА ПТУ.Контрагент = ОП.КонтрагентЗаказчик
	|				И ОП.КонтрагентЗаказчик <> &ПустойКонтрагент
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КонтрагентОК,
	|	ВЫБОР
	|		КОГДА ПодтвСтатьей.Документ ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СтатьяОК,
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ОП.Дата, ДЕНЬ), НАЧАЛОПЕРИОДА(ПТУ.Дата, ДЕНЬ), ДЕНЬ) КАК РазностьДней
	|ИЗ
	|	Документ.А_ОтгрузкаПродукции КАК ОП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПТУ
	|		ПО ПТУ.Подразделение = ОП.Заказчик
	|			И ПТУ.Организация = ОП.Организация
	|			И ПТУ.СуммаДокумента = ОП.СуммаДокумента
	|			И ПТУ.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ОП.Дата, ДЕНЬ), ДЕНЬ, -3)
	|					И ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ОП.Дата, ДЕНЬ), ДЕНЬ, 3)
	|			И НЕ ПТУ.ПометкаУдаления
	|			И ПТУ.Проведен
	|			И ПТУ.А_ОказаниеУслугМеждуПодразделениями = &ПустоеОказание
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПодтвержденоСтатьей КАК ПодтвСтатьей
	|		ПО ПодтвСтатьей.Документ = ПТУ.Ссылка
	|			И ПодтвСтатьей.Отгрузка = ОП.Ссылка
	|ГДЕ
	|	ОП.Ссылка В (&Отгрузки)";

	Возврат ПодготовитьТаблицуКандидатов(Запрос.Выполнить().Выгрузить());

КонецФункции

// Кандидаты реализации: у Акта ключ - цех отгрузки, у Реализации - заказчик.
Функция ПолучитьКандидатовРеализации(Отгрузки)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Отгрузки", Отгрузки);
	Запрос.УстановитьПараметр("ПустойКонтрагент", Справочники.Контрагенты.ПустаяСсылка());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОП.Ссылка КАК Отгрузка,
	|	ОП.Дата КАК ОтгрузкаДата,
	|	Акт.Ссылка КАК Документ,
	|	Акт.Номер КАК Номер,
	|	ВЫБОР
	|		КОГДА Акт.Контрагент = ОП.КонтрагентЗаказчик
	|				И ОП.КонтрагентЗаказчик <> &ПустойКонтрагент
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КонтрагентОК,
	|	ЛОЖЬ КАК СтатьяОК,
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ОП.Дата, ДЕНЬ), НАЧАЛОПЕРИОДА(Акт.Дата, ДЕНЬ), ДЕНЬ) КАК РазностьДней
	|ИЗ
	|	Документ.А_ОтгрузкаПродукции КАК ОП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктВыполненныхРабот КАК Акт
	|		ПО Акт.Подразделение = ОП.Подразделение
	|			И Акт.СуммаДокумента = ОП.СуммаДокумента
	|			И Акт.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ОП.Дата, ДЕНЬ), ДЕНЬ, -3)
	|					И ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ОП.Дата, ДЕНЬ), ДЕНЬ, 3)
	|			И НЕ Акт.ПометкаУдаления
	|			И Акт.Проведен
	|ГДЕ
	|	ОП.Ссылка В (&Отгрузки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОП.Ссылка,
	|	ОП.Дата,
	|	РТУ.Ссылка,
	|	РТУ.Номер,
	|	ВЫБОР
	|		КОГДА РТУ.Контрагент = ОП.КонтрагентЗаказчик
	|				И ОП.КонтрагентЗаказчик <> &ПустойКонтрагент
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ОП.Дата, ДЕНЬ), НАЧАЛОПЕРИОДА(РТУ.Дата, ДЕНЬ), ДЕНЬ)
	|ИЗ
	|	Документ.А_ОтгрузкаПродукции КАК ОП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РТУ
	|		ПО РТУ.Подразделение = ОП.Заказчик
	|			И РТУ.СуммаДокумента = ОП.СуммаДокумента
	|			И РТУ.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ОП.Дата, ДЕНЬ), ДЕНЬ, -3)
	|					И ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ОП.Дата, ДЕНЬ), ДЕНЬ, 3)
	|			И НЕ РТУ.ПометкаУдаления
	|			И РТУ.Проведен
	|ГДЕ
	|	ОП.Ссылка В (&Отгрузки)";

	Возврат ПодготовитьТаблицуКандидатов(Запрос.Выполнить().Выгрузить());

КонецФункции

// Приводит выгрузку запроса к таблице кандидатов с неотрицательной дельтой.
Функция ПодготовитьТаблицуКандидатов(ТаблицаЗапроса)

	ТаблицаЗапроса.Колонки.Добавить("Дельта", Новый ОписаниеТипов("Число"));
	Для Каждого СтрокаТаблицы Из ТаблицаЗапроса Цикл
		СтрокаТаблицы.Дельта = ?(СтрокаТаблицы.РазностьДней < 0,
			-СтрокаТаблицы.РазностьДней, СтрокаТаблицы.РазностьДней);
	КонецЦикла;
	ТаблицаЗапроса.Колонки.Удалить("РазностьДней");

	Возврат ТаблицаЗапроса;

КонецФункции

// Документы, уже закрепленные журналом за ДРУГИМИ отгрузками.
Функция ПолучитьЗанятыеДокументы(Отгрузки, ИмяРесурса)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Отгрузки", Отгрузки);
	Запрос.Текст =
	// Отбор по заполненности НЕ делаем в запросе: у составного типа условия
	// "<> ПустаяСсылка" и "ЕСТЬ НЕ NULL" пропускают незаполненное значение.
	"ВЫБРАТЬ
	|	Журнал." + ИмяРесурса + " КАК Документ,
	|	Журнал.Отгрузка КАК Отгрузка
	|ИЗ
	|	РегистрСведений.А_ПодборАктовПоОтгрузке КАК Журнал
	|ГДЕ
	|	НЕ Журнал.Отгрузка В (&Отгрузки)";

	Занятые = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Документ) Тогда
			Занятые.Вставить(Выборка.Документ, Выборка.Отгрузка);
		КонецЕсли;
	КонецЦикла;

	Возврат Занятые;

КонецФункции

// Пишет журнал и реквизиты документов по итогам подбора.
Процедура ЗафиксироватьРезультат(Результат)

	Для Каждого СтрокаРезультата Из Результат Цикл

		НаборЗаписей = РегистрыСведений.А_ПодборАктовПоОтгрузке.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Отгрузка.Установить(СтрокаРезультата.Отгрузка);

		Запись = НаборЗаписей.Добавить();
		Запись.Отгрузка = СтрокаРезультата.Отгрузка;
		Запись.Приобретение = СтрокаРезультата.Приобретение;
		Запись.Реализация = СтрокаРезультата.Реализация;
		Запись.Статус = СтрокаРезультата.Статус;
		Запись.ДельтаДней = СтрокаРезультата.ДельтаДней;
		Запись.ПодтвержденоСтатьейPL = СтрокаРезультата.ПодтвержденоСтатьейPL;
		Запись.ПодтвержденоКонтрагентом = СтрокаРезультата.ПодтвержденоКонтрагентом;
		Запись.КандидатовВсего = СтрокаРезультата.КандидатовВсего;
		Запись.ДатаПодбора = ТекущаяДатаСеанса();
		Запись.Комментарий = Лев(СтрокаРезультата.Комментарий, 250);
		НаборЗаписей.Записать(Истина);

		ЗаписатьРеквизитыОтгрузки(СтрокаРезультата.Отгрузка,
			СтрокаРезультата.Приобретение, СтрокаРезультата.Реализация);

	КонецЦикла;

КонецПроцедуры

// Записывает ссылки в реквизиты документа.
//
// ВАЖНО: запись только через ОбменДанными.Загрузка = Истина. Иначе ПриЗаписи вызовет
// СоздатьДокументОказанияУслугМеждуПодразделениямиПоОтгрузкаПродукции(), которая первым
// шагом ПОМЕЧАЕТ НА УДАЛЕНИЕ все существующие услуги отгрузки и подчиненные им документы.
//
Функция ЗаписатьРеквизитыОтгрузки(ОтгрузкаСсылка, Приобретение, Реализация)

	ТекущееПриобретение = ОтгрузкаСсылка.ДокПриобретениеТоваровУслуг;
	ТекущаяРеализация = ОтгрузкаСсылка.ДокРеализацияТоваровУслуг;

	// Флаг отвечает на вопрос "по каким отгрузкам документов в учете нет":
	// Истина, если найдена хотя бы одна из двух ссылок.
	НайденыДокументы = ЗначениеЗаполнено(Приобретение) ИЛИ ЗначениеЗаполнено(Реализация);

	НужноПриобретение = ЗначениеЗаполнено(Приобретение) И ТекущееПриобретение <> Приобретение;
	НужноРеализация = ЗначениеЗаполнено(Реализация) И ТекущаяРеализация <> Реализация;
	НужноФлаг = (ОтгрузкаСсылка.НайденыДокументыВУчете <> НайденыДокументы);

	Если Не НужноПриобретение И Не НужноРеализация И Не НужноФлаг Тогда
		Возврат Ложь;
	КонецЕсли;

	ДокОбъект = ОтгрузкаСсылка.ПолучитьОбъект();
	Если ДокОбъект = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Если НужноПриобретение Тогда
		ДокОбъект.ДокПриобретениеТоваровУслуг = Приобретение;
	КонецЕсли;
	Если НужноРеализация Тогда
		ДокОбъект.ДокРеализацияТоваровУслуг = Реализация;
	КонецЕсли;
	ДокОбъект.НайденыДокументыВУчете = НайденыДокументы;

	ДокОбъект.ОбменДанными.Загрузка = Истина;
	ДокОбъект.Записать();

	Возврат Истина;

КонецФункции

// Описание таблицы результата подбора.
Функция НоваяТаблицаРезультата()

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Отгрузка");
	Таблица.Колонки.Добавить("Статус");
	Таблица.Колонки.Добавить("Приобретение");
	Таблица.Колонки.Добавить("Реализация");
	Таблица.Колонки.Добавить("ДельтаДней", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("ПодтвержденоСтатьейPL", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("ПодтвержденоКонтрагентом", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("КандидатовВсего", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("Комментарий", Новый ОписаниеТипов("Строка"));

	Возврат Таблица;

КонецФункции

// Добавляет строку в таблицу результата.
Процедура ДобавитьРезультат(Результат, ОтгрузкаСсылка, Статус, Назначение, КандидатовВсего,
	Комментарий = "", Реализация = Неопределено)

	СтрокаРезультата = Результат.Добавить();
	СтрокаРезультата.Отгрузка = ОтгрузкаСсылка;
	СтрокаРезультата.Статус = Статус;
	СтрокаРезультата.КандидатовВсего = КандидатовВсего;
	СтрокаРезультата.Комментарий = Комментарий;
	СтрокаРезультата.Реализация = Реализация;

	Если Назначение = Неопределено Тогда
		СтрокаРезультата.Приобретение = Документы.ПриобретениеТоваровУслуг.ПустаяСсылка();
	Иначе
		СтрокаРезультата.Приобретение = Назначение.Документ;
		СтрокаРезультата.ДельтаДней = Назначение.Дельта;
		СтрокаРезультата.ПодтвержденоСтатьейPL = Назначение.СтатьяОК;
		СтрокаРезультата.ПодтвержденоКонтрагентом = Назначение.КонтрагентОК;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
